[{
    "summary": "Each Bitcoin halving sees Bitcoin miners rewarded with a smaller block subsidy, but ViaBTC is optimistic that innovative Bitcoin applications will more than cover these needs, as Satoshi Nakamoto envisioned.",
    "date": "2024-05-10",
    "post_content": "Bitcoin transaction fees from applications such as Ordinals, Runes and BRC-20s will be key to making sure miners stick around even as more halving events occur, according to a cryptocurrency mining pool.\n“[The Bitcoin network’s] evolution has led to an expanding array of use cases and a growing user base [which] has significantly impacted miners’ fee income from on-chain transactions,” ViaBTC told Cointelegraph in a recent interview.\nPrior to the Ordinals protocol’s launch in January 2023, miners relied on peer-to-peer transaction fees to accompany the block subsidy — which halves every 210,000 blocks and thus has an “indisputable” impact on miners’ revenue over the long haul, ViaBTC said.\nMining revenue can also increase with a rise in Bitcoin’s (BTC) price, but further development at the application layer will increase network activity, broaden its utility and thereby compensate miners handsomely, ViaBTC explained.\nViaBTC experienced this first hand on April 20 when it mined the highly sought-after halving block, at block 840,000, which came with a record-setting 37.6 BTC transaction fee — worth $2.4 million at the time.\nThe reward, which totaled 40.7 BTC when factoring in the new 3.125 BTC block subsidy, came from memecoin and nonfungible token enthusiasts competing to inscribe “rare satoshis” and fungible tokens via the new Runes token standard, which launched at the halving block.\nSource: 10x Research\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nViaBTC told Cointelegraph it had a “premonition” that transaction fees would eventually break the 30, 40, 50 BTC barrier but didn’t expect they would be the beneficiaries of such a massive reward — let alone at the halving block.\nWhile Bitcoin miners cashed in an eye-popping $78.3 million on halving day, they’ve also made more from fees than Ethereum stakers and Uniswap liquidity providers in nine of the last 20 days since the halving, according to Crypto Fees.\nFees by blockchains and protocols on April 20. Source: Crypto Fees\nBitcoin’s pseudonymous creator, Satoshi Nakamoto, predicted that transaction fees would eventually become miners’ main compensation source as the block subsidy halves, ViaBTC noted.\nRelated: Bitcoin post-halving price consolidation could last 2 months — Bitfinex\n“If these transactions find broader utility in the future and make significant technological advancements, they may garner increased attention and recognition,” ViaBTC added.\nHowever, Ordinals inscriptions, Runes and BRC-20s have seen several rises and falls in popularity since each protocol launched, which has brought about some instability in miner revenue.\nViaBTC has endured three halving events since it started operating in 2016, with block 840,000 being the 37,534th block that it had mined in its 2,900-day existence.\nThe mining pool’s hash rate is sourced from miners in 118 countries.\nMagazine: 68% of Runes are in the red — Are they really an upgrade for Bitcoin?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s\/ advertiser’s t&c and help\/ support pages for more information.\nAd",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/58df8084-29e9-44f9-8107-0d4169aa7662.jpg",
    "author": "by Brayden Lindrea",
    "title": "Bitcoin’s Ordinals, Runes key to solving the mining subsidy problem: ViaBTC",
    "url": "https:\/\/cointelegraph.com\/news\/bitcoin-ordinals-runes-brc20s-mitigating-halving-effect-viabtc",
    "tags": ["#Bitcoin", "#Blockchain", "#Satoshi Nakamoto", "#Business", "#Bitcoin Mining", "#Mining Pools", "#Halving", "#Bitcoin Halving", "#BRC", "#ViaBTC", "#Bitcoin Ordinals", "#Runes Protocol"]
}, {
    "summary": "Base is already home to 46% of transactions related to SocialFi on-chain, but the asset manager says it has even more room to grow.",
    "date": "2024-05-09",
    "post_content": "Trillion-dollar asset manager Franklin Templeton suggests “Base Season” has arrived with the rise of Social Finance (SocialFi) apps, with Base leading other Ethereum layer 2s in the vertical.\n“[It is] positioning itself well to capture a material share of SocialFi activity and remain a leader in the Ethereum L2 sector going forward,” Franklin Templeton said in a May report.\nAbout 46% of transactions related to SocialFi are on Base, which has increasingly stripped market share away from the BNB Chain and Polygon in recent months, according to one of the charts provided by Franklin Templeton.\nFranklin Templeton said support from Coinbase has played a key role in Base capturing nearly half of the SocialFi market share to date.\nFriend.tech is perhaps the most notable SocialFi application built on Base, which allows creators to connect and monetize their content through “key” shares or “tokenized attention.”\n“Base has hit a homerun in the world of SocialFi,” which will remain a “key vertical to watch” for Base’s adoption and growth over the long haul, Franklin Templeton said.\nSource: Franklin Templeton\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nTheta Network, Decentralized Social, Fantasy.top and Steem are among the other popular SocialFi blockchains and protocols. \nFranklin Templeton highlighted the recent memecoin mania as another key contributor to Base’s rise in network activity.\nRelated: Coinbase sees infinite interoperability potential with Ethereum and USDC\nBase is the third largest Ethereum layer 2 network by total value locked now with $5.4 billion, only trailing Arbitrum One and OP Mainnet at $15.9 billion and $6.90 billion respectively, according to L2BEAT.\nHowever, Base has risen from $1 billion to $5.4 billion in less than three months after it taking six months to break the $1 billion milestone,\nMeanwhile, Arbitrum One and OP Mainnet have seen their TVLs tallies fall over the last two months.\nCoinbase officially launched Base last August. The cryptocurrency exchange is the sole sequencer of Base, meaning the chain is fully controlled by the exchange, L2BEAT data shows.\nHowever, Coinbase intends on progressively decentralizing Base over time.\nIt was built using Optimism’s OP stack, and is focused on offering a secure, cost-efficient, and builder-friendly environment for Ethereum Virtual Machine-compatible applications.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/c9d6d256-2dea-4ced-a3f2-1635cd033528.jpg",
    "author": "by Brayden Lindrea",
    "title": "Base set for ‘material share’ of SocialFi activity: Franklin Templeton",
    "url": "https:\/\/cointelegraph.com\/news\/coinbase-ethereum-l2-base-material-share-socialfi-franklin-templeton",
    "tags": ["#Blockchain", "#Coinbase", "#Business", "#Adoption", "#Base", "#Memecoin"]
}, {
    "summary": "Coinbase head of tokenization Anthony Bassili described plans for its Base network at TokenizeThis 2024 in Miami.",
    "date": "2024-05-09",
    "post_content": "Coinbase is preparing for a future of a billion customers using decentralized applications on millions of blockchains safely and securely in a system integrating the Ethereum Virtual Machine (EVM) and Circle’s USD Coin (USDC). \nCoinbase head of tokenization Anthony Bassili, speaking at TokenizeThis 2024 in Miami, said Coinbase’s Ethereum layer-2 Base blockchain will save time on Know Your Customer (KYC) and Anti-Money Laundering (AML) with identity attestation through the Ethereum Attestation service and Coinbase verification, which creates a tag on the user’s so-called smart wallet.\nCoinbase verification is available after the customer has completed its KYC procedure. While that may not be sufficient in all cases, Bassili said:\n“We expect that eventually to evolve into something like a KYC reliance model. […] And it will start to form market structure that makes it a lot easier for a simpler KYC process.”\nAlready more than 300,000 wallets have been attested.\nRelated: Coinbase's Base could make it the NVIDIA of DeFi\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nTo give those customers with wallets and verified identities Web3 access, Base will leverage the interoperability of EVM networks. The ecosystem will be supported by USDC. Coinbase took an equity stake in Circle in August. “Right now, we're somewhere above $28 billion of total assets” in Circle, Bassili said. Coinbase also has the ability to mint USDC.\nCoinbase head of tokenization Anthony Bassili (right) at TokenizeThis 2024. Source: Sam Bourgi\/Cointelegraph\nWhen robust tokenized assets in different asset classes arise, it could become possible to trade assets for assets, without going through the intermediate step of trading them for dollars. Bassili said:\n“I think […] we're a while away from [that goal], because we need regulatory structures to show up, we need products themselves to be designed with identity checks instantly, and there is a lot of market structure that is still has to come.”\n“Crypto is the perfect embodiment of a liquid free open market structure where you can design any amount of complexity into it and have assets, trade with each other, don't have to be dollar pairs trade,” Bassili said. In the meantime, USDC provides a first step to developing that market structure.\nMagazine: 6 Questions for Kim Hamilton Duffy of Centre\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s\/ advertiser’s t&c and help\/ support pages for more information.\nAd",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/e1c248a2-a475-45ea-871b-d166806f711b.jpg",
    "author": "by Derek Andersen",
    "title": "Coinbase sees infinite interoperability potential with Ethereum and USDC",
    "url": "https:\/\/cointelegraph.com\/news\/coinbase-base-blockchain-evm-usdc-ethereum-integration",
    "tags": ["#Blockchain", "#Coinbase", "#Decentralization", "#Ethereum", "#KYC", "#AML", "#Base", "#USD Coin", "#Regulation"]
}, {
    "summary": "Ripple joins the Hedera and Algorand Foundations and industry players to advance a recovery standard to rival ERC-4337.",
    "date": "2024-05-09",
    "post_content": "Ripple is among the new members onboarded to the Decentralized Recovery Alliance (DeRec), an industry organization seeking to create a simplified, standardized secrets management system. It brings XRPL Labs with it and joins Algorand and Hedera and members of their ecosystems, among others.\nDeRec is developing a tool to make Web3 more accessible by providing open-source management for “secrets,” such as digital assets, accounts, keys, passwords, photographs and other digital material, that will not require the high level of user sophistication necessary today. The DeRec app would simplify storage and provide a means of recovering information in case of a lost device. It was invented by Hedera co-founder Leemon Baird and debuted in January.\nSource: Dagnum P.I. \nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe DeRec app allows users to select helpers who will hold encrypted fragments of the user’s secrets held in a library file. It hopes to introduce Helper-as-a-Service in the future. Helpers will not have access to the fragments, although the organization notes that it is liable to 51% attack:\n“If less than half of Alex’s [a hypothetical “layperson”] helpers were to collude, the helpers would still be unable to access the vault.”\nThe DeRec app is setting itself up as an alternative to Ethereum’s ERC-4337 smart account standard, known as account abstraction, introduced in March 2023. Polygon, Optimism, Arbitrum, BNB Smart Chain, Avalanche and Gnosis Chain are among the Ethereum Virtual Machine-compatible networks that can use that standard.\nRelated: Tokenized mortgages can prevent another housing bubble crisis, says Casper exec\nBesides being available to other blockchains, the DeRec app claims to be able to hold secrets of any type, whether onchain or offchain. In addition, its use would be undetectable, and the identities of the helpers could not be discovered. RippleX Senior Vice President Markus Infanger commented:\n“Together, we can revolutionize how users manage their private keys, representing a major step forward for user security and adoption – not just for XRP Ledger users, but for everyone in crypto.”\nRipple joins the Algorand Foundation, Hedera-affiliated Swirlds Labs and Ripple-associated XRPL Labs as founding members of DeRec, giving it a seat on its Technical Oversight Committee. Besides the three major blockchain organizations and their affiliates, blockchain-enabled healthcare network Acoer, industry service providers The Building Blocks and BankSocial, wallet infrastructure provider Blade Labs, the Casper and Constellation blockchain foundations and Key backup and recovery solution provider Revive Labs are members of DeRec.\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide\nExchange or buy XRP\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s\/ advertiser’s t&c and help\/ support pages for more information.\nAd",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/94e3af9a-a60f-4b48-8d7c-1f0ae302be71.jpg",
    "author": "by Derek Andersen",
    "title": "Ripple joins multi-chain DeRec Alliance for secrets management",
    "url": "https:\/\/cointelegraph.com\/news\/ripple-joins-derec-secrets-management-web3",
    "tags": ["#Blockchain", "#Ethereum", "#Ripple", "#Private Keys", "#Algorand", "#Hedera", "#Seed Phrase"]
}, {
    "summary": "Both firms deny any involvement in the allegations brought forth by The Wall Street Journal.",
    "date": "2024-05-09",
    "post_content": "Amid new allegations of market manipulation brought by The Wall Street Journal, both Binance co-founder Yi He and market make DWF Labs have denied any involvement. \nIn an X post on May 9, He described the media report as an occurrence that “greatly increased our exposure and saved us a lot of marketing budget.” However, the co-founder denied any of the allegations made against Binance, writing: \n“I have noticed an interesting phenomenon where some mainstream media articles are increasingly driven by emotions and biases rather than facts. For example, the complaints of former employees can become the basis of an article, while Binance’s proactive assistance to law enforcement agencies in investigating and apprehending the mastermind behind Zkasino (as a matter of fact) is not deemed worthy of reporting.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nIn a similar post the same day, DWF Labs said the allegations were “unfounded and distort the facts” and that the firm “operates with the highest standards of integrity, transparency, and ethics, and we remain committed to supporting you and our over 700 partners across the crypto ecosystem.” \nEarlier on May 9, a Wall Street Journal report claimed that DWF Labs, one of Binance’s largest trading clients, engaged in market manipulation, wash trading and inflated trading volumes amounting to $300 million through deals with crypto projects. After the exchange’s surveillance team recommended offboarding the client, Binance allegedly sided with DWF Labs and fired the investigator, arguing insufficient evidence for the claim.\n“We affirm our strict market surveillance program [and] do not tolerate market abuse,” He commented. “Over the last three years, we have offboarded nearly 355,000 users with a transaction volume of more than $2.5 trillion for violating our terms of use,” He added, continuing: “Market maker competition is fierce, and our investigation team’s job is to be neutral and look at the evidence without any bias, including bias that might come from market-making firms’ claims against their competitors.”\nDWF Labs is a prominent trading firm in the crypto industry. Founded by Andrei Grachev in 2021, the firm invests in promising projects and provides long-term financial support. \nRelated: Binance denies reports of DWF Labs market manipulation\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/5b36a7cc-7449-4d81-992c-627a2230fcbd.jpg",
    "author": "by Zhiyuan Sun",
    "title": "Binance co-founder and DWF Labs speak out against market manipulation allegations",
    "url": "https:\/\/cointelegraph.com\/news\/binance-cofounder-dwf-labs-speaks-out-against-market-manipulation-allegations",
    "tags": ["#Blockchain", "#Cryptocurrencies", "#Business", "#Binance"]
}, {
    "summary": "During the TokenizeThis 2024 event, executives from Ripple and Stellar discussed the latest trends in tokenization, including the blending of payments and investments.",
    "date": "2024-05-09",
    "post_content": "The lines between payment and investment assets are becoming increasingly blurred. In the near future, it may be possible to split a dinner and pay using shares of tokenized funds, a blend made possible by tokenizing assets.\nRob Durscki, senior director of tokenization at the Stellar Development Foundation, shared the prediction during the TokenizeThis 2024 event in Miami on May 9. According to him, the bridge between payments and investments will unlock new utilities across financial products. Durscki noted:\n“What we’re seeing now with partners like Franklin Templeton, WisdomTree, and others issuing this new round of assets on-chain is that they want to unlock yield, [...] but they also want to make it almost seamless to use as a payment tool as well.”\nTokenization is the process of converting rights or ownership of an asset, like real estate or stocks, into a digital token on a blockchain. This enables a digital representation of the asset, allowing for fractional ownership, increasing liquidity and making some financial products more accessible to small investors.\n“Nothing prevents us here from splitting the check on the dinner, and I’ll pay with Franklin Temple funds because I can send you $20 in 3.6 seconds on Stellar. [...] If you forget about that, you’re still getting 5%, 6% a year on that dinner. [...] This positive blur between investment and payment because it’s ultimately value, right? And we’re unlocking the movement of value.”\nTokenizeThis 2024. Source: Sam Bourgi\/Cointelegraph\nRipple’s vice president of engineering, Bradley Chase, also participated in the panel and spoke about customization trends emerging from enterprise customers. According to Chase, more and more enterprises are seeking to receive stablecoin payments and hold tokens on-chain as a way of generating additional revenue.\n“Those customers now have their own customers that want to pay in stablecoins and they want to hold those stablecoins. So that’s kind of the simplest on and off-ramp gateway for them into the space.”\nMore than $1 billion worth of U.S. Treasurys has already been tokenized across Ethereum, Stellar, and other blockchains. A recent estimate from Ripple forecasts tokenized markets to reach $16 trillion in the coming years, a figure eight times larger than the total market capitalization of the entire cryptocurrency sector.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nMagazine: Lazarus Group’s favorite exploit revealed — Crypto hacks analysis\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/319520aa-399b-46b2-81cd-71cfb194ff01.jpg",
    "author": "by Ana Paula Pereira",
    "title": "Tokenization to unlock interoperability across payments, investments",
    "url": "https:\/\/cointelegraph.com\/news\/tokenization-unlock-interoperability-across-payments-investments",
    "tags": ["#Blockchain", "#Business", "#Tokens", "#DeFi"]
}, {
    "summary": "Centralized instant messaging apps are plagued with censorship, outages and data security concerns. Here’s how decentralization can help.",
    "date": "2024-05-09",
    "post_content": "Communication remains a basic necessity no matter how much humanity moves forward. The digital era has brought a myriad of online tools that bring people together, and it was a rather swift transition from postcards to Discord groups.\nInstant messaging applications with social elements, such as Slack, Discord or WhatsApp, operate as communication enablers for hundreds of millions of users worldwide. Both individuals and businesses utilize the rich features and ease of use found in such applications.\nHowever, as the power of communication becomes more concentrated under the hands of a few centralized services, a certain set of concerns arise:\nPrivacy and data security: Centralized platforms store user data on servers controlled by a single entity, making them attractive targets for hackers and raising concerns about how these companies use the data for advertising or other purposes.\nCensorship: Centralized entities can censor or moderate content according to their policies or external pressures, leading to arbitrary removal of content or entire communities.\nService outages: Centralization means that every user is affected if the service’s servers go down. This creates a single point of failure.\nMonetization and advertisements: Centralized platforms may prioritize profit over user experience, leading to invasive advertising or selling user data to third parties.\nHow decentralization can improve digital communication\nDecentralized networks offer solutions to the biggest pain points of the Web2-era communication. Blockchain-based decentralization can potentially enhance privacy and security by distributing data across numerous points on the network, making it harder for unauthorized parties to access or compromise user information.\nWithout a centralized entity controlling the communication network, censorship and outage risks can be minimized. Thanks to the user-centric nature of Web3, it’s also easier to enable new monetization models that empower participants.\nThe concept of a decentralized application (DApp) for instant messaging grew quickly over the years, giving birth to several examples. However, providing on-chain communication with Web2-like features is easier said than done. Most DApps that attempt to offer Web2-like features encounter significant hurdles.\nWhile decentralization enhances privacy and reduces censorship, it often comes at the cost of performance and user experience. For instance, achieving real-time communication — which is critical for user satisfaction in messaging apps — is more complex on a decentralized network due to increased latency and inconsistent data synchronization across nodes.\nFurthermore, most DApps compromise by handling user-facing, front-end features off-chain to maintain performance. This approach dilutes the principles of decentralization and limits the functionality and scalability of these applications. As a result, while DApps represent a promising frontier in digital communication, their current implementations are often incomplete and do not fully harness the advantages of blockchain technology.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nFully on-chain communication at scale\nOpenChat, a crypto messaging platform, aims to herald a new era in digital communication, leveraging the power of blockchain technology to deliver a unique, decentralized chatting experience. The platform promises enhanced security and autonomy for users, positioning them prominently in the development of Web3 and making it a relevant choice for those interested in the future of online interaction. OpenChat is running digital communication end-to-end — including front-end — on the Internet Computer (ICP).\nOpenChat is made possible by ICP, a blockchain network designed to expand the functionalities of the internet, offering a platform for smart contracts and DApps to run at web speed directly on the blockchain. ICP’s unique infrastructure aims to unlock the full potential of DApps, helping them perform at traditional Web2 speeds while keeping the whole process on the blockchain.\nOpenChat provides Discord-like servers in a decentralized environment. Source: OpenChat\nRunning on ICP makes it possible for OpenChat to offer the same performance and feature set as Discord or Slack while providing full benefits of decentralization, including data security, reliability and censorship resistance. On top of traditional chat features, OpenChat is also equipped with crypto-native functionality, allowing users to send and receive tokens as chat messages and swap tokens either through integrations with exchanges or in a peer-to-peer fashion.\nThe communication DApp has recently introduced video and voice chat support, with the initial launch including one-to-one video calls in direct chats and group video calls of up to twenty people in private chats. OpenChat’s phase two will target community broadcasts.\nWeb3 chat app governed by its users\nThe idea of decentralization and end-to-end on-chain communication offered by OpenChat has received a warm welcome from the ICP ecosystem. The project raised over 1 million ICP (worth $5.5 million at the time of fundraising) in five hours in March 2023 to become a fully functional decentralized autonomous organization (DAO) led by its community of shareholders.\nAs part of the ICP ecosystem, OpenChat is now controlled by a DAO and uses CHAT as its governance token. CHAT tokenholders will be able to govern the platform and make their voices heard regarding the future of OpenChat, Matt Grogan, co-founder of OpenChat, said at the time.\nOpenChat also offers a video chat feature. Source: OpenChat\nIn August, after the successful transition into a DAO, OpenChat enabled users to create Communities — servers with a Discord-meets-Slack style that enables group admins to create subgroups for more focused conversations. Users can find communities based on common interests or create their own. OpenChat co-founder Julian Jelfs shared plans to enable the OpenChat Communities feature for projects to integrate as a communication tool on their own websites.\nThe roadmap for decentralized communication\nOne of the primary goals of the DApp is to introduce end-to-end encryption for chats in 2024 to offer superior security and privacy. The roadmap of OpenChat also includes a sophisticated tokenization system to reward users for posting key content with CHAT tokens. The development team is fully pledged to keep pace with major Web2 competitors and lead innovation in Web3, meaning the feature set of OpenChat will evolve and expand as digital communication advances.\nOpenChat will be featured in the upcoming global ICPCC event on May 10, which will showcase how ICP technology can enhance decentralized applications on any blockchain.\nFully decentralized platforms like OpenChat aim to address the privacy, security and centralization challenges by offering enhanced privacy, reduced censorship and a user-governed ecosystem. It promises to safeguard user data and empower users through community-led governance and innovative monetization strategies planned for the future.\nLearn more about OpenChat\n#Blockchain\n#Adoption\n#DApps\n#DAO\n#Web3\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/storage\/uploads\/view\/344bd6644b9ce9beda75462355979bc9.jpg",
    "author": "by Mike Kara",
    "title": "The future of online communication: Secure and censorship-resistant chat on blockchain",
    "url": "https:\/\/cointelegraph.com\/news\/the-future-of-online-communication-secure-and-censorship-resistant-chat-on-blockchain",
    "tags": ["#Blockchain", "#Adoption", "#DApps", "#DAO", "#Web3"]
}, {
    "summary": "This marks the first period of Ethereum becoming inflationary in the past year and a half since the Merge took place.",
    "date": "2024-05-09",
    "post_content": "The Ether\nETH\n$3,028\nsupply has ceased to be deflationary following Ethereum’s highly anticipated Dencun upgrade that went live two months ago.\nTotal Ether supply increased to 120.1 million on May 7, from 120 million on March 12, before the Dencun upgrade was rolled out on mainnet, according to CryptoQuant data.\nWhile this is a small increase, it marks the first period when Ether supply turned inflationary since September 2022, when the much-anticipated Merge transitioned Ethereum to its current proof-of-stake consensus model.\nEthereum: Total Supply and Fees Burned. Source: CryptoQuant\nEther temporarily losing its deflationary status is not critical for the Ethereum network since its main benefits are more related to decentralized applications (DApps), according the founder and CEO of Cryptoquant. In a May 9 X post, Ki Young Ju wrote:\n“Post-Dencun upgrade, $ETH lost deflationary status with reduced fees, departing from “ultrasound money.” Ethereum’s strength lies in DApps; it’s wiser not to compare it to Bitcoin’s sound money narrative.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nEthereum Total Transactions and Fees Burned. Source: Ki Young Ju\nEther supply first turned deflationary after the Merge on Sept. 15, 2022, when a mechanism that permanently burned transaction fees on the network was introduced resulting in a decreasing Ether supply.\nOver 419,713 Ether tokens were burned, or permanently removed from circulation, since the Merge, according to ultrasound.money.\nSource: ultrasound.money\nRelated: Dencun is a big step towards mass adoption: Metis CEO\nThe death of “ultra sound” money?\nThe Dencun upgrade has ended Ether’s inflationary streak by making median transaction fees as much as four times cheaper than before, with the same level of network activity.\nWhile this is a significant step for the Ethereum network and its users, it could spell the end of Ether’s status as ultra-sound money, according to a May 8 report by CryptoQuant.\n“The Dencun upgrade has made ETH inflationary again, potentially killing the narrative of “Ultra sound” money as a structurally lower amount of transaction fees burned on Ethereum have had the corresponding effect of not decreasing the total supply of ETH to keep it deflationary.”\nDue to lower transaction fees, the amount of Ether being burned has declined to its lowest levels since the Merge, while supply growth has risen to its highest level since the upgrade.\nRelated: VanEck subsidiary’s memecoin index up 137% year-to-date\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s\/ advertiser’s t&c and help\/ support pages for more information.\nAd",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/863bc733-d422-40a7-9f8b-ee81c8618ea9.jpg",
    "author": "by Zoltan Vardai",
    "title": "Ether turns inflationary for the first time since Merge",
    "url": "https:\/\/cointelegraph.com\/news\/ethereum-dencun-upgrade-ether-supply-shift",
    "tags": ["#Blockchain", "#Ethereum", "#Ethereum Price", "#Dencun Upgrade"]
}, {
    "summary": "Taiwan’s Ministry of Justice proposed four amendments to the country’s AML regulations focused on cryptocurrency firms that plan to impose hefty penalties for noncompliance.",
    "date": "2024-05-09",
    "post_content": "Taiwan wants to amend its Anti-Money Laundering (AML) regulations to combat fraud and AML measures for virtual asset service providers (VASPs). \nTaiwan’s Ministry of Justice has proposed amendments to existing AML laws that could impose jail terms of up to two years for noncompliant firms and fines of up to $1.5 million. The proposed amendments will be sent to Taiwan’s national parliament, the Legislative Yuan, for review.\nThe “New Four Laws to Combat Fraud” was proposed by Taiwan’s Executive Yuan. The amendments aim to strengthen the crackdown on fraud and strictly regulate money laundering prevention measures for crypto service providers.\nThe four critical components of the amended regulations include the fraud crime harm prevention regulations, the money laundering prevention law, the technology investigation and security law, and the communications security and supervision law.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe most notable change comes from the new money laundering prevention law targeting virtual asset service providers. VASPs that violate the law will face harsher penalties for noncompliance.\nThree distinct modifications have been made to the law, requiring revised registration requirements and restrictions for domestic and international currency dealers.\nUnder the newly amended laws, VASPs risk prison sentences if they offer services without registering with the relevant authority.\nA new legal category has also been introduced for money laundering offenses linked to third-party payment accounts and virtual asset accounts.\nRelated: Taiwan will review global trends before deciding on crypto ETFs\nThe penalties for utilizing third-party accounts for money laundering could lead to jail terms of six months to five years and fines of up to 50 million New Taiwan dollars ($1.5 million).\nTaiwan’s Deputy Minister of Justice, Huang Mou-hsin, said under the current provisions, the authorities can only penalize noncompliant cryptocurrency companies administratively. However, the new proposed law criminalizes such behavior with hefty fines and prison time.\nThe proposed law would make foreign cryptocurrency platforms risk criminal penalties unless they establish local firms and seek AML registration.\nThe latest proposal comes a couple of months after the country’s securities regulator said it would propose new laws for digital assets by September.\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/9e3cc440-98c8-4592-b89f-9d68102baf74.jpg",
    "author": "by Prashant Jha",
    "title": "Taiwan proposes tougher AML measures for crypto service providers",
    "url": "https:\/\/cointelegraph.com\/news\/taiwan-aml-regulations-crypto-fraud",
    "tags": ["#Blockchain", "#Cryptocurrencies", "#China", "#Taiwan", "#Regulation"]
}, {
    "summary": "This represents a 15x increase compared to the S&P 500’s year-to-date returns.",
    "date": "2024-05-09",
    "post_content": "The MarketVector Meme Coin Index surged over 137% since the beginning of 2024 as the top memecoins continue to rise.\nMarketVector’s memecoin index has outperformed the S&P 500 index by over 15x in 2024. In contrast, the S&P only saw a 9.3% price appreciation year-to-date (YTD), according to TradingView data.\nThe memecoin index is up over 137% year-to-date and 186% over the past year, trading at $76.60 as of 8:52 am UTC.\nMarketVector Meme Coin Index, year-to-date. Source: MarketVector\nMarketVector, a subsidiary of the United States asset management giant VanEck, launched its memecoin index on Oct. 31, 2021. It includes the six largest memecoins: Dogecoin\nDOGE\n$0.15\nat a 30.7% allocation, Shiba Inu\nSHIB\n$0.000023\nat a 28.3% allocation, 14.5% Pepe\nPEPE\n$0.000009\n, 12.5% Dogwifhat (WIF), 7.14% Floki Inu (FLOKI) and 6.7% Bonk (BONK) tokens.\nThe “high risk, high return strategy” makes memecoins attractive for investors with a speculative nature and will likely keep the top coins relevant, according to Anndy Lian, intergovernmental blockchain expert and author of NFT: From Zero to Hero. Lian told Cointelegraph:\n“This creates a viral effect that can lead to rapid price increases. Many investors are attracted to the potential for quick, high returns. Memecoins are known for their volatility, which can result in substantial gains for traders who time their investments right.”\nLooking at the memecoin fund’s individual components, Pepe was the biggest gainer, rising 482% YTD, followed by Floki, up 372%, and Shiba Inu, up 112%, taking third place. Bonk was the worst performer, up over 59% YTD, but still beating the returns of the S&P 500 by over sixfold.\nTop six memecoins, YTD, Source: TradingView\nMemecoins often deliver exponential returns, even compared to some of the top cryptocurrencies. Compared to the memecoin index’s 137% appreciation, the top altcoins, excluding the 10 largest cryptocurrencies, saw their market caps only rise 24% YTD.\nAltcoin market cap excluding top 10. Source: TradingView\nTop altcoins experience weekly sell-off\nDespite the profitable yearly returns, the six largest memecoins saw a sell-off this week, raising concerns of a potential end to the memecoin season. Over the past five days, Dogwifhat fell over 15% as the biggest loser, while Pepe fell over 5% — the smallest decline among the top memecoins.\nTop memecoins, five-day chart. Source: TradingView\nSince memecoins hold no underlying utility, it’s difficult for traders and technical analysts to predict their price action, which is mainly driven by social media hype cycles for each memecoin.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nTrading volume is often used to gauge sentiment around memecoins. Weekly memecoin trading volume has been declining since early March across all blockchains, as reported by Cointelegraph.\nRelated: Trader loses 7-figure sum due to 0L Network hard fork\nExchange or buy DOGE\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s\/ advertiser’s t&c and help\/ support pages for more information.\nAd",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/50a3d738-e193-4fa9-87c0-acaf6d75f5b8.jpg",
    "author": "by Zoltan Vardai",
    "title": "VanEck subsidiary’s memecoin index up 137% year-to-date",
    "url": "https:\/\/cointelegraph.com\/news\/marketvector-memecoin-index-surges-2024",
    "tags": ["#Blockchain", "#Dogecoin", "#Cryptocurrencies", "#Altcoin", "#Ethereum", "#DeFi", "#Memecoin", "#Pepe", "#Floki Inu"]
}, {
    "summary": "Ghana Post launched a crypto stamp collection to showcase its king’s 25-year-long journey of persevering in traditional values and adopting new-age technology.",
    "date": "2024-05-09",
    "post_content": "Ghana’s national postal service is ensuring that its king’s 25th coronation anniversary will be remembered forever, unaltered, on the blockchain.\nGhana Post released a new stamp collection, “Crypto Stamp,” in honor of His Majesty Otumfuo Osei Tutu II. The crypto stamp collection pays homage to the king’s 25-year-long contribution to Ghana’s development and cultural integrity.\nSignaling this blend of traditional values and new-age technology, the physical crypto stamps are linked to unique nonfungible tokens (NFT) that are verifiable over the blockchain.\nRead this Cointelegraph crypto guide to learn more about how NFTs work.\nGhana’s new crypto stamp collection. Source: Ghana Post\nAccording to the listing, crypto stamps are limited to 7,200 pieces and cost 250 Ghanaian cedi ($18) per stamp. \nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nWhen attempting to make a purchase, the website failed to provide any information regarding shipping charges for international destinations.\nUpon purchase, users need to manually link their physical collectible to its digital twin over the blockchain to claim its exclusivity. The physical stamps come with an integrated near-field communication (NFC) chip to help this pairing.\n“Through a simple smartphone scan, collectors can verify the stamp’s authenticity in real-time, with each scan generating a unique, one-time authentication message, safeguarding against tampering and counterfeit attempts.”\nCrypto stamp is the most expensive stamp collection the Ghana Post offers, with others costing less than half its crypto counterpart. However, the store currently offers a one-of-one exclusive gold frame stamp that costs roughly 100,000 cedi ($7,200).\nGhana Post’s stamp collections sorted by price. Source: Ghana Post\nGhana claimed its position as the first African country to introduce a commemorative NFT-based stamp collection.\nRelated: Nigeria launches first multilingual large language model in Africa\nThe South African Reserve Bank recently decided to amp up efforts toward regulating and adopting cryptocurrency and central bank digital currency (CBDC).\nRead Cointelegraph’s guide to learn more about CBDCs.\nThe roadmap looked at high-level plans to increase the accessibility of financial technology, modernize payment infrastructure and remove barriers to use. The plan’s scope is strictly domestic.\nMagazine: What do crypto market makers actually do? Liquidity, or manipulation\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/f529e3d4-6a0e-40c9-823a-fabb4fdc77d0.jpg",
    "author": "by Arijit Sarkar",
    "title": "Ghana’s crypto stamps honor king’s Silver Jubilee",
    "url": "https:\/\/cointelegraph.com\/news\/ghana-post-crypto-stamps-king-anniversary",
    "tags": ["#Blockchain", "#Government", "#Africa", "#Ghana", "#Crypto Collectibles", "#NFT"]
}, {
    "summary": "DWF Labs was first hit by market manipulation accusations in September 2023.",
    "date": "2024-05-09",
    "post_content": "Binance has denied the latest allegations surrounding alleged market manipulation from DWF Labs.\nAllegations over DWF Labs’s alleged market manipulation have reemerged. An anonymous source claiming to be a former Binance insider said that Binance investigators uncovered $300 million worth of wash trading from DWF during 2023, according to a May 9 report in The Wall Street Journal.\nWhen asked about the market manipulation incident, Binance denied the reports. A Binance spokesperson told Cointelegraph:\n“Binance emphatically rejects any assertion that its market surveillance program has permitted market manipulation on our platform. We have a robust market surveillance framework that identifies and takes action against market abuse. Any users that breach our terms of use are off-boarded; we do not tolerate market abuse.”\nAccording to the WSJ report, DWF Labs’ manipulated the price of the Yield Guild Game (YGG) token and at least six other cryptocurrencies in 2023. However, Binance said that its surveillance program would make this impossible.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nBinance is actively banning traders that showcase signs of market manipulation, a spokesperson told Cointelegraph:\n“Over the last three years, we have offboarded nearly 355,000 users with a transaction volume of more than $2.5 trillion for violating our terms of use.”\nInvestigating potential market manipulation is a top priority for Binance, the world’s largest exchange, which is also evidenced by independent investigations, Binance’s spokesperson added:\n“A recent independent investigation from Inca Digital into Binance’s market surveillance practices validates the effectiveness of our approach, finding ‘minimal signs of anomalous trading activities.‘”\nRelated: Public blockchain ledgers ‘not fit for purpose,’ says JPMorgan exec\nDWF Labs — a Web3 investment and market-making firm — was first hit by market manipulation allegations in September 2023 after high-volume on-chain activity raised the eyebrows of crypto investors.\nWintermute, an algorithmic trading firm and market maker, was among the first companies to accuse DWF Labs of crypto market manipulation. \nDuring a September interview at Token2049, Wintermute co-founder Yoann Turpin said that DWF Labs “are not market makers in our sense” and confuse users because they “declare what are essentially [over-the-counter] trades as investments.”\nAndrei Grachev, the co-founder of DWF Labs, has strongly denied the allegations.\nRelated: Trader loses 7-figure sum due to 0L Network hard fork\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/ad66a185-a52d-479b-8a68-bf875eaf5ee0.jpg",
    "author": "by Zoltan Vardai",
    "title": "Binance denies reports of DWF Labs market manipulation",
    "url": "https:\/\/cointelegraph.com\/news\/dwf-labs-market-manipulation-binance",
    "tags": ["#Blockchain", "#Cryptocurrencies", "#Fraud", "#DeFi", "#Trading"]
}, {
    "summary": "Elizabeth Stark unpacked the basics of Bitcoin Lightning at FT Live’s Crypto and Digital Assets Summit and teased a new development on Bitcoin’s leading layer 2.",
    "date": "2024-05-09",
    "post_content": "Stablecoins running on Bitcoin are edging closer to reality through new functionality built by Lightning Labs using the network’s Taproot upgrade implemented in late 2021.\nElizabeth Stark, CEO of Lightning Labs, unpacked the latest development from the Bitcoin development firm at FT Live’s Crypto and Digital Assets Summit in London.\nThe firm’s co-founder also gave an eloquent explainer of Bitcoin and the Lightning Network to an audience of traditional finance players.\nLightning Labs co-founder Elizabeth Stark on stage at FT Live: Source: Gareth Jenkinson\nLightning Labs’ Taproot assets protocol is building functionality to bring stablecoins and tokenized assets to Bitcoin. According to Stark, developers have made significant headway toward this goal, culminating in the testing of transactions on Lightning:\n“We released an early part of the code in October and recently demoed the first-ever transaction on Lightning of an asset. The idea is to have crypto dollars and stablecoins on the Bitcoin blockchain.”\nStark added that traditionally, these digital assets have operated on other blockchains that have suffered from high fees and other issues. She argues that Bitcoin’s network is perhaps best placed to facilitate the use of stablecoins because it “is the most secure and decentralized” blockchain.\nBitcoin and stablecoins value as a store of value\nStark went on to discuss the merits of Bitcoin (BTC) and stablecoins as a store of value, especially in nations grappling with inflation issues and devaluing fiat currencies.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nThe Lightning Labs CEO said stablecoin adoption has grown dramatically since the COVID-19 pandemic, with users largely being based in emerging markets.\n“The stickiest users have been those looking for a stable store of value. In some cases, they’re using Bitcoin. In other cases, they’re using stablecoins, and in some cases, it’s a combination of both,” Stark explained.\nRelated: What is the Bitcoin Lightning Network, and how does it work?\nThe two largest stablecoin players — Tether (USDT) and Circle’s USD Coin (USDC) — hold more United States Treasury bonds combined than major nations like Germany and South Korea. Stark said this is an intriguing fact, given that end-users don’t benefit from the interest of holding stablecoins.\nFor those in countries grappling with hyperinflation or precarious economic environments, the choice of holding a stablecoin is driven by the need for a store of value.\nLightning-powered stablecoins will be superior\nGiven the significant growth in value of the stablecoin market, Stark said there is a need for the infrastructure to enable the issuance of stablecoins and real-world assets on the Bitcoin blockchain.\n“That’s why we’re building this protocol, this technology right now. We’re not issuing assets, we’re building the rails. Asset issuers will use our technology to issue real-world tokenized assets,” Stark explained.\nRelated: Coinbase integrates Lightning Network for Bitcoin transactions\nThe CEO added that financial institutions could issue gold assets, stablecoins and other fiat-backed assets on Bitcoin and then transact over the Lightning Network.\nPerhaps most telling was the relative cost compared to other blockchains and conventional traditional finance systems, which Stark highlighted:\n“If you look at Visa where fees in the U.S. can be upward of 3%, or even 1%, the fees, transacting with stablecoins on Lightning can be dramatically lower, a cent or less than that.”\nStark added that this could competitively enable people to transact globally at far lower rates than through traditional networks.\nMagazine: 68% of Runes are in the red — Are they really an upgrade for Bitcoin?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s\/ advertiser’s t&c and help\/ support pages for more information.\nAd",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/af30e930-a493-4c0c-8068-390768266079.jpg",
    "author": "by Gareth Jenkinson",
    "title": "Stablecoins on Bitcoin coming soon, suggests Lightning Labs CEO",
    "url": "https:\/\/cointelegraph.com\/news\/bitcoin-lightning-labs-taproot-stablecoin-functionality",
    "tags": ["#Bitcoin", "#Blockchain", "#Bitcoin Analysis", "#Adoption", "#Bitcoin Payments", "#Lightning Network", "#Lightning"]
}, {
    "summary": "The Web3 and AI firm Giza plans to bring autonomous bots onto Starknet by the end of June.",
    "date": "2024-05-09",
    "post_content": "Ethereum layer-2 blockchain Starknet will soon allow artificial intelligence (AI) agents on its blockchain that can autonomously perform on-chain activities for users, such as optimizing yield and re-allocating portfolios.\nGiza — a firm aiming to bring AI to blockchains — raised $3 million in a pre-seed round led by CoinFund in July 2023 and is spearheading the effort. Co-founder Ren Korzay told Cointelegraph that AI agents would be deployed on Starknet by the end of June, with other chains to follow.\nKorzay said the agents could take over four activities, the first being yield aggregating — finding “where the highest return is and depositing to different yield avenues.”\nLater releases will see the AI agents also be a “robo-advisor and figure out the best portfolio allocation for a user given their risk appetite,” said Korzay.\nIn the beta phase, the Giza team will be auditing and approving agent strategies to ensure security. In the future, Agents will become completely permissionless through the Giza Protocol, which will provide both cryptographic and cryptoeconomic security to ensure a trust-minimized exchange between developers and users.\nThey can also autonomously provide liquidity on decentralized exchanges or make leveraged price bets and “predict price movements,” adjusting crypto holdings “based on the strategy set by the user,” he added.\nThe yield-optimizing AI agents will be the first to deploy, with the other types to follow, according to a May 9 press release shared with Cointelegraph.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nIt’s billed as “low-cost and low-computation,” and it can max out returns by buying or selling assets so they stay at the same weighting in a portfolio on lending platforms that it can directly use and sign off on transactions.\n“As all accounts on Starknet are smart contracts — via the network’s native account abstraction features — this allows for proofs to be verified directly within the contract,” Giza explained.\nThree-month Starknet active users chart. March saw activity spike as it conducted a token airdrop. Source: Starkscan\nThe AI models are built with the Starknet programming language Cairo and “verify complex computations” using Zero-Knowledge Scalable Transparent Argument of Knowledge and zero-knowledge proofs (ZK-proofs) created by Starknet development firm StarkWare.\nZK-proofs allow for information to be shared and authenticated while maintaining user privacy.\nRelated: Philosopher Yuval Noah Harari warns of AI’s risks in finance\nGiza co-founder Cem Dagdelen said in a statement the company expects agents will “become the new application layer for Web3, abstracting away smart contract risks and complexities from users.”\nHowever, the agents aren’t limited to just crypto and blockchain. According to Giza, they can also help “highly regulated sectors” cut oversight costs by using models to check “the validity of their outputs.”\nAva Labs founder Emin Gn Sirer said at a recent blockchain conference he thinks AI-backed smart contract coding is five to 10 years away and, when it arrives, could “onboard billions of new [blockchain] users.”\nMeanwhile, Ethereum co-founder Vitalik Buterin has cautioned developers that it’s “worth treading carefully” when adding AI to blockchains, saying AI can help humans understand what is happening on-chain, but it shouldn’t be tasked with enforcing smart contract rules.\nMagazine: How to control the AIs and incentivize the humans with crypto\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/4332983b-3e31-4fee-a57c-4dddcff9cf35.jpg",
    "author": "by Jesse Coghlan",
    "title": "Starknet to bring on AI agents that can carry out on-chain activity",
    "url": "https:\/\/cointelegraph.com\/news\/starknet-brings-autonomous-giza-ai-agents-to-blockchain",
    "tags": ["#Blockchain", "#AI", "#DeFi", "#zk-STARK"]
}, {
    "summary": "If approved, the EU’s UCITS funds would make way for crypto assets to gain exposure to a 12 trillion euro investment product market.",
    "date": "2024-05-09",
    "post_content": "Update 12:55 pm UTC: This article has been updated to include quotes from Nicolas Streschinsky.\nThe European Union security watchdog, the European Securities and Markets Authority (ESMA), is seeking the opinion of experts on whether to add crypto to the 12 trillion euro ($12.8 trillion) investment product market.\nThe ESMA asked industry experts for their views on whether Undertakings for Collective Investment in Transferable Securities (UCITS) — an investment product market valued at 12 trillion euros — can gain exposure to different asset classes such as structured or leveraged loans, catastrophe bonds, emission allowances, commodities, crypto assets and unlisted equities.\nUCITS are a class of investment funds comprising products intended to protect and simplify investing transactions. UCITS are often comprised of mutual, exchange-traded or money market funds. EU regulations govern these funds; however, non-EU investors can also gain exposure.\nUCITS stakeholders have until Aug. 7 to submit their comments. If approved, UCITS would become one of the largest mainstream funds with crypto exposure.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe request for expert opinions comes amid the approval of spot Bitcoin (BTC) exchange-traded funds in the United States and Hong Kong, with securities regulators worldwide appearing to warm up to crypto exposure in traditional investment vehicles.\nRelated: The Runes protocol will ignite a new season for Bitcoin after the halving\nWhile spot BTC ETFs are solely crypto-focused, UCITS investments are divided into numerous fund types, each with a particular asset allocation based on the fund’s risk profile.\nIf approved, there won’t be an independent UCITS fund with 100% crypto allocation but multiple UCITS funds with a percentage allocation in crypto.\nNicolas Streschinsky, the Head of DeFi at Trilitech,  Tezos blockchain R&D and Entrepreneur Hub, told Cointelegraph that UCITS funds are very successful and commonly held by investors outside the EU who trust that type of vehicle.\n“The inclusion of a — likely small — percentage of crypto assets in some UCITS funds could be another catalyst in broadening the holder base of cryptocurrency assets, specifically utility tokens used to pay transaction fees on major blockchains,” he added.\nEU regulations currently prohibit independent crypto-centered investment products. Thus, investors have to access them via exchange-traded notes.\nThe European Union is known for its strict crypto regulatory policy. It is one of the first regions to introduce a complete crypto regulatory framework in the form of its Markets in Crypto-Assets Regulation (MiCA).\nOne of the questions asked by the ESMA in the feedback is how adding specific cryptocurrencies to the framework would or wouldn’t be affected by MiCA.\nMagazine: What do crypto market makers actually do? Liquidity, or manipulation\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s\/ advertiser’s t&c and help\/ support pages for more information.\nAd",
    "post_cover": "https:\/\/images.cointelegraph.com\/cdn-cgi\/image\/format=auto,onerror=redirect,quality=90,width=1434\/https:\/\/s3.cointelegraph.com\/uploads\/2024-05\/fc96b5c5-5238-413e-9cdb-8594f80f2fd5.jpg",
    "author": "by Prashant Jha",
    "title": "EU seeks stakeholder opinions on adding crypto to 12T euro investment market",
    "url": "https:\/\/cointelegraph.com\/news\/eu-securities-watchdog-considers-crypto-inclusion-12t-investment-market",
    "tags": ["#Bitcoin", "#Blockchain", "#Europe", "#European Union", "#MiCA", "#Regulation"]
}]